-------------------------------------------------------------------------------------------------------------------------------------------------------------
      name:  <unnamed>
       log:  /Users/johncoglianese/Documents/Research/LFPR/Forecasting/logs/lfpr_by_age_sex_and_cohort_12_Mar_2018_21_16_16.log
  log type:  text
 opened on:  16 Mar 2018, 16:12:36

. 
end of do-file

. use "data/lfpr_age_sex_cohort.dta", clear

. desc

Contains data from data/lfpr_age_sex_cohort.dta
  obs:         7,269                          
 vars:             6                          3 Dec 2017 20:54
 size:       145,380                          
-------------------------------------------------------------------------------------------------------------------------------------------------------------
              storage   display    value
variable name   type    format     label      variable label
-------------------------------------------------------------------------------------------------------------------------------------------------------------
year            int     %8.0g                 survey year
age             byte    %8.0g      AGE        age
sex             byte    %8.0g      SEX        sex
lfp             float   %9.0g                 (mean) lfp
n               double  %9.0g                 (rawsum) n
cohort          float   %9.0g                 
-------------------------------------------------------------------------------------------------------------------------------------------------------------
Sorted by: age  sex  year

. help freduse

. help tsintegrate_cea

. help tsdetrend_cea

. freduse UNRATE, clear
(842 observations read)

. browse

. gen time = mofd(daten)

. tsset time
        time variable:  time, -144 to 697
                delta:  1 unit

. format time %tm

. tsset time
        time variable:  time, 1948m1 to 2018m2
                delta:  1 month

. tsdetrend_cea ugap = UNRATE, window(120)
The smoother applied was
     (1/119.9999999638296)*[0*x(t-120) + .0002582510489*x(t-119) + .0010243778935*x(t-118) + .0022855224609*x(t-117) + .0040289351852*x(t-116) +
     .0062419750072*x(t-115) + .008912109375*x(t-114) + .0120269142433*x(t-113) + .0155740740741*x(t-112) + .0195413818359*x(t-111) +
     .0239167390046*x(t-110) + .0286881555628*x(t-109) + .03384375*x(t-108) + .0393717493128*x(t-107) + .0452604890046*x(t-106) +
     .0514984130859*x(t-105) + .0580740740741*x(t-104) + .0649761329933*x(t-103) + .072193359375*x(t-102) + .0797146312572*x(t-101) +
     .0875289351852*x(t-100) + .0956253662109*x(t-99) + .1039931278935*x(t-98) + .1126215322989*x(t-97) + .1215*x(t-96) + .1306180600767*x(t-95) +
     .1399653501157*x(t-94) + .1495316162109*x(t-93) + .159306712963*x(t-92) + .1692806034795*x(t-91) + .179443359375*x(t-90) + .1897851607711*x(t-89) +
     .2002962962963*x(t-88) + .2109671630859*x(t-87) + .2217882667824*x(t-86) + .232750221535*x(t-85) + .24384375*x(t-84) + .2550596833406*x(t-83) +
     .2663889612269*x(t-82) + .2778226318359*x(t-81) + .2893518518519*x(t-80) + .3009678864656*x(t-79) + .312662109375*x(t-78) + .324426002785*x(t-77) +
     .3362511574074*x(t-76) + .3481292724609*x(t-75) + .3600521556713*x(t-74) + .3720117232711*x(t-73) + .384*x(t-72) + .3960091191045*x(t-71) +
     .408031322338*x(t-70) + .4200589599609*x(t-69) + .4320844907407*x(t-68) + .4441004819517*x(t-67) + .456099609375*x(t-66) + .4680746572989*x(t-65) +
     .4800185185185*x(t-64) + .4919241943359*x(t-63) + .5037847945602*x(t-62) + .5155935375072*x(t-61) + .52734375*x(t-60) + .5390288673683*x(t-59) +
     .5506424334491*x(t-58) + .5621781005859*x(t-57) + .5736296296296*x(t-56) + .5849908899378*x(t-55) + .596255859375*x(t-54) + .6074186243128*x(t-53)
     + .6184733796296*x(t-52) + .6294144287109*x(t-51) + .6402361834491*x(t-50) + .6509331642433*x(t-49) + .6615*x(t-48) + .6719314281322*x(t-47) +
     .6822222945602*x(t-46) + .6923675537109*x(t-45) + .7023622685185*x(t-44) + .7122016104239*x(t-43) + .721880859375*x(t-42) + .7313954038267*x(t-41)
     + .7407407407407*x(t-40) + .7499124755859*x(t-39) + .758906322338*x(t-38) + .7677181034795*x(t-37) + .77634375*x(t-36) + .7847793013961*x(t-35) +
     .7930209056713*x(t-34) + .8010648193359*x(t-33) + .8089074074074*x(t-32) + .81654514341*x(t-31) + .823974609375*x(t-30) + .8311924958406*x(t-29) +
     .8381956018519*x(t-28) + .8449808349609*x(t-27) + .8515452112269*x(t-26) + .8578858552156*x(t-25) + .864*x(t-24) + .86988498716*x(t-23) +
     .8755382667824*x(t-22) + .8809573974609*x(t-21) + .8861400462963*x(t-20) + .8910839888961*x(t-19) + .895787109375*x(t-18) + .9002474003545*x(t-17)
     + .904462962963*x(t-16) + .9084320068359*x(t-15) + .9121528501157*x(t-14) + .9156239194517*x(t-13) + .91884375*x(t-12) + .9218109854239*x(t-11) +
     .9245243778935*x(t-10) + .9269827880859*x(t-9) + .9291851851852*x(t-8) + .9311306468822*x(t-7) + .932818359375*x(t-6) + .9342476173683*x(t-5) +
     .9354178240741*x(t-4) + .9363284912109*x(t-3) + .9369792390046*x(t-2) + .9373697961878*x(t-1) + .9375*x(t) + .9373697961878*x(t+1) +
     .9369792390046*x(t+2) + .9363284912109*x(t+3) + .9354178240741*x(t+4) + .9342476173683*x(t+5) + .932818359375*x(t+6) + .9311306468822*x(t+7) +
     .9291851851852*x(t+8) + .9269827880859*x(t+9) + .9245243778935*x(t+10) + .9218109854239*x(t+11) + .91884375*x(t+12) + .9156239194517*x(t+13) +
     .9121528501157*x(t+14) + .9084320068359*x(t+15) + .904462962963*x(t+16) + .9002474003545*x(t+17) + .895787109375*x(t+18) + .8910839888961*x(t+19) +
     .8861400462963*x(t+20) + .8809573974609*x(t+21) + .8755382667824*x(t+22) + .86988498716*x(t+23) + .864*x(t+24) + .8578858552156*x(t+25) +
     .8515452112269*x(t+26) + .8449808349609*x(t+27) + .8381956018519*x(t+28) + .8311924958406*x(t+29) + .823974609375*x(t+30) + .81654514341*x(t+31) +
     .8089074074074*x(t+32) + .8010648193359*x(t+33) + .7930209056713*x(t+34) + .7847793013961*x(t+35) + .77634375*x(t+36) + .7677181034795*x(t+37) +
     .758906322338*x(t+38) + .7499124755859*x(t+39) + .7407407407407*x(t+40) + .7313954038267*x(t+41) + .721880859375*x(t+42) + .7122016104239*x(t+43) +
     .7023622685185*x(t+44) + .6923675537109*x(t+45) + .6822222945602*x(t+46) + .6719314281322*x(t+47) + .6615*x(t+48) + .6509331642433*x(t+49) +
     .6402361834491*x(t+50) + .6294144287109*x(t+51) + .6184733796296*x(t+52) + .6074186243128*x(t+53) + .596255859375*x(t+54) + .5849908899378*x(t+55)
     + .5736296296296*x(t+56) + .5621781005859*x(t+57) + .5506424334491*x(t+58) + .5390288673683*x(t+59) + .52734375*x(t+60) + .5155935375072*x(t+61) +
     .5037847945602*x(t+62) + .4919241943359*x(t+63) + .4800185185185*x(t+64) + .4680746572989*x(t+65) + .456099609375*x(t+66) + .4441004819517*x(t+67)
     + .4320844907407*x(t+68) + .4200589599609*x(t+69) + .408031322338*x(t+70) + .3960091191045*x(t+71) + .384*x(t+72) + .3720117232711*x(t+73) +
     .3600521556713*x(t+74) + .3481292724609*x(t+75) + .3362511574074*x(t+76) + .324426002785*x(t+77) + .312662109375*x(t+78) + .3009678864656*x(t+79) +
     .2893518518519*x(t+80) + .2778226318359*x(t+81) + .2663889612269*x(t+82) + .2550596833406*x(t+83) + .24384375*x(t+84) + .232750221535*x(t+85) +
     .2217882667824*x(t+86) + .2109671630859*x(t+87) + .2002962962963*x(t+88) + .1897851607711*x(t+89) + .179443359375*x(t+90) + .1692806034795*x(t+91)
     + .159306712963*x(t+92) + .1495316162109*x(t+93) + .1399653501157*x(t+94) + .1306180600767*x(t+95) + .1215*x(t+96) + .1126215322989*x(t+97) +
     .1039931278935*x(t+98) + .0956253662109*x(t+99) + .0875289351852*x(t+100) + .0797146312572*x(t+101) + .072193359375*x(t+102) +
     .0649761329933*x(t+103) + .0580740740741*x(t+104) + .0514984130859*x(t+105) + .0452604890046*x(t+106) + .0393717493128*x(t+107) +
     .03384375*x(t+108) + .0286881555628*x(t+109) + .0239167390046*x(t+110) + .0195413818359*x(t+111) + .0155740740741*x(t+112) +
     .0120269142433*x(t+113) + .008912109375*x(t+114) + .0062419750072*x(t+115) + .0040289351852*x(t+116) + .0022855224609*x(t+117) +
     .0010243778935*x(t+118) + .0002582510489*x(t+119) + ...; x(t)= __000000 note: label truncated to 80 characters

. tsline ugap UNRATE

. do "/var/folders/0b/rk0m4vps1wdcl9c2sqsp12480000gn/T//SD02688.000000"

. freduse UNRATE, clear
(842 observations read)

. 
. gen time = mofd(daten)

. gen year = yofd(daten)

. format time %tm

. tsset time
        time variable:  time, 1948m1 to 2018m2
                delta:  1 month

. 
. tsdetrend_cea unrate_trend = UNRATE, window(120)
The smoother applied was
     (1/119.9999999638296)*[0*x(t-120) + .0002582510489*x(t-119) + .0010243778935*x(t-118) + .0022855224609*x(t-117) + .0040289351852*x(t-116) +
     .0062419750072*x(t-115) + .008912109375*x(t-114) + .0120269142433*x(t-113) + .0155740740741*x(t-112) + .0195413818359*x(t-111) +
     .0239167390046*x(t-110) + .0286881555628*x(t-109) + .03384375*x(t-108) + .0393717493128*x(t-107) + .0452604890046*x(t-106) +
     .0514984130859*x(t-105) + .0580740740741*x(t-104) + .0649761329933*x(t-103) + .072193359375*x(t-102) + .0797146312572*x(t-101) +
     .0875289351852*x(t-100) + .0956253662109*x(t-99) + .1039931278935*x(t-98) + .1126215322989*x(t-97) + .1215*x(t-96) + .1306180600767*x(t-95) +
     .1399653501157*x(t-94) + .1495316162109*x(t-93) + .159306712963*x(t-92) + .1692806034795*x(t-91) + .179443359375*x(t-90) + .1897851607711*x(t-89) +
     .2002962962963*x(t-88) + .2109671630859*x(t-87) + .2217882667824*x(t-86) + .232750221535*x(t-85) + .24384375*x(t-84) + .2550596833406*x(t-83) +
     .2663889612269*x(t-82) + .2778226318359*x(t-81) + .2893518518519*x(t-80) + .3009678864656*x(t-79) + .312662109375*x(t-78) + .324426002785*x(t-77) +
     .3362511574074*x(t-76) + .3481292724609*x(t-75) + .3600521556713*x(t-74) + .3720117232711*x(t-73) + .384*x(t-72) + .3960091191045*x(t-71) +
     .408031322338*x(t-70) + .4200589599609*x(t-69) + .4320844907407*x(t-68) + .4441004819517*x(t-67) + .456099609375*x(t-66) + .4680746572989*x(t-65) +
     .4800185185185*x(t-64) + .4919241943359*x(t-63) + .5037847945602*x(t-62) + .5155935375072*x(t-61) + .52734375*x(t-60) + .5390288673683*x(t-59) +
     .5506424334491*x(t-58) + .5621781005859*x(t-57) + .5736296296296*x(t-56) + .5849908899378*x(t-55) + .596255859375*x(t-54) + .6074186243128*x(t-53)
     + .6184733796296*x(t-52) + .6294144287109*x(t-51) + .6402361834491*x(t-50) + .6509331642433*x(t-49) + .6615*x(t-48) + .6719314281322*x(t-47) +
     .6822222945602*x(t-46) + .6923675537109*x(t-45) + .7023622685185*x(t-44) + .7122016104239*x(t-43) + .721880859375*x(t-42) + .7313954038267*x(t-41)
     + .7407407407407*x(t-40) + .7499124755859*x(t-39) + .758906322338*x(t-38) + .7677181034795*x(t-37) + .77634375*x(t-36) + .7847793013961*x(t-35) +
     .7930209056713*x(t-34) + .8010648193359*x(t-33) + .8089074074074*x(t-32) + .81654514341*x(t-31) + .823974609375*x(t-30) + .8311924958406*x(t-29) +
     .8381956018519*x(t-28) + .8449808349609*x(t-27) + .8515452112269*x(t-26) + .8578858552156*x(t-25) + .864*x(t-24) + .86988498716*x(t-23) +
     .8755382667824*x(t-22) + .8809573974609*x(t-21) + .8861400462963*x(t-20) + .8910839888961*x(t-19) + .895787109375*x(t-18) + .9002474003545*x(t-17)
     + .904462962963*x(t-16) + .9084320068359*x(t-15) + .9121528501157*x(t-14) + .9156239194517*x(t-13) + .91884375*x(t-12) + .9218109854239*x(t-11) +
     .9245243778935*x(t-10) + .9269827880859*x(t-9) + .9291851851852*x(t-8) + .9311306468822*x(t-7) + .932818359375*x(t-6) + .9342476173683*x(t-5) +
     .9354178240741*x(t-4) + .9363284912109*x(t-3) + .9369792390046*x(t-2) + .9373697961878*x(t-1) + .9375*x(t) + .9373697961878*x(t+1) +
     .9369792390046*x(t+2) + .9363284912109*x(t+3) + .9354178240741*x(t+4) + .9342476173683*x(t+5) + .932818359375*x(t+6) + .9311306468822*x(t+7) +
     .9291851851852*x(t+8) + .9269827880859*x(t+9) + .9245243778935*x(t+10) + .9218109854239*x(t+11) + .91884375*x(t+12) + .9156239194517*x(t+13) +
     .9121528501157*x(t+14) + .9084320068359*x(t+15) + .904462962963*x(t+16) + .9002474003545*x(t+17) + .895787109375*x(t+18) + .8910839888961*x(t+19) +
     .8861400462963*x(t+20) + .8809573974609*x(t+21) + .8755382667824*x(t+22) + .86988498716*x(t+23) + .864*x(t+24) + .8578858552156*x(t+25) +
     .8515452112269*x(t+26) + .8449808349609*x(t+27) + .8381956018519*x(t+28) + .8311924958406*x(t+29) + .823974609375*x(t+30) + .81654514341*x(t+31) +
     .8089074074074*x(t+32) + .8010648193359*x(t+33) + .7930209056713*x(t+34) + .7847793013961*x(t+35) + .77634375*x(t+36) + .7677181034795*x(t+37) +
     .758906322338*x(t+38) + .7499124755859*x(t+39) + .7407407407407*x(t+40) + .7313954038267*x(t+41) + .721880859375*x(t+42) + .7122016104239*x(t+43) +
     .7023622685185*x(t+44) + .6923675537109*x(t+45) + .6822222945602*x(t+46) + .6719314281322*x(t+47) + .6615*x(t+48) + .6509331642433*x(t+49) +
     .6402361834491*x(t+50) + .6294144287109*x(t+51) + .6184733796296*x(t+52) + .6074186243128*x(t+53) + .596255859375*x(t+54) + .5849908899378*x(t+55)
     + .5736296296296*x(t+56) + .5621781005859*x(t+57) + .5506424334491*x(t+58) + .5390288673683*x(t+59) + .52734375*x(t+60) + .5155935375072*x(t+61) +
     .5037847945602*x(t+62) + .4919241943359*x(t+63) + .4800185185185*x(t+64) + .4680746572989*x(t+65) + .456099609375*x(t+66) + .4441004819517*x(t+67)
     + .4320844907407*x(t+68) + .4200589599609*x(t+69) + .408031322338*x(t+70) + .3960091191045*x(t+71) + .384*x(t+72) + .3720117232711*x(t+73) +
     .3600521556713*x(t+74) + .3481292724609*x(t+75) + .3362511574074*x(t+76) + .324426002785*x(t+77) + .312662109375*x(t+78) + .3009678864656*x(t+79) +
     .2893518518519*x(t+80) + .2778226318359*x(t+81) + .2663889612269*x(t+82) + .2550596833406*x(t+83) + .24384375*x(t+84) + .232750221535*x(t+85) +
     .2217882667824*x(t+86) + .2109671630859*x(t+87) + .2002962962963*x(t+88) + .1897851607711*x(t+89) + .179443359375*x(t+90) + .1692806034795*x(t+91)
     + .159306712963*x(t+92) + .1495316162109*x(t+93) + .1399653501157*x(t+94) + .1306180600767*x(t+95) + .1215*x(t+96) + .1126215322989*x(t+97) +
     .1039931278935*x(t+98) + .0956253662109*x(t+99) + .0875289351852*x(t+100) + .0797146312572*x(t+101) + .072193359375*x(t+102) +
     .0649761329933*x(t+103) + .0580740740741*x(t+104) + .0514984130859*x(t+105) + .0452604890046*x(t+106) + .0393717493128*x(t+107) +
     .03384375*x(t+108) + .0286881555628*x(t+109) + .0239167390046*x(t+110) + .0195413818359*x(t+111) + .0155740740741*x(t+112) +
     .0120269142433*x(t+113) + .008912109375*x(t+114) + .0062419750072*x(t+115) + .0040289351852*x(t+116) + .0022855224609*x(t+117) +
     .0010243778935*x(t+118) + .0002582510489*x(t+119) + ...; x(t)= __000000 note: label truncated to 80 characters

. 
. gen ugap = UNRATE - unrate_trend

. 
. collapse (mean) ugap, by(year)

. 
. save "data/ugap.dta", replace
(note: file data/ugap.dta not found)
file data/ugap.dta saved

. 
end of do-file

. tsset year
        time variable:  year, 1948 to 2018
                delta:  1 unit

. tsline ugap

. do "/var/folders/0b/rk0m4vps1wdcl9c2sqsp12480000gn/T//SD02688.000000"

. freduse UNRATE, clear
(842 observations read)

. 
. gen time = mofd(daten)

. gen year = yofd(daten)

. format time %tm

. tsset time
        time variable:  time, 1948m1 to 2018m2
                delta:  1 month

. 
. tsdetrend_cea unrate_trend = UNRATE, window(120)
The smoother applied was
     (1/119.9999999638296)*[0*x(t-120) + .0002582510489*x(t-119) + .0010243778935*x(t-118) + .0022855224609*x(t-117) + .0040289351852*x(t-116) +
     .0062419750072*x(t-115) + .008912109375*x(t-114) + .0120269142433*x(t-113) + .0155740740741*x(t-112) + .0195413818359*x(t-111) +
     .0239167390046*x(t-110) + .0286881555628*x(t-109) + .03384375*x(t-108) + .0393717493128*x(t-107) + .0452604890046*x(t-106) +
     .0514984130859*x(t-105) + .0580740740741*x(t-104) + .0649761329933*x(t-103) + .072193359375*x(t-102) + .0797146312572*x(t-101) +
     .0875289351852*x(t-100) + .0956253662109*x(t-99) + .1039931278935*x(t-98) + .1126215322989*x(t-97) + .1215*x(t-96) + .1306180600767*x(t-95) +
     .1399653501157*x(t-94) + .1495316162109*x(t-93) + .159306712963*x(t-92) + .1692806034795*x(t-91) + .179443359375*x(t-90) + .1897851607711*x(t-89) +
     .2002962962963*x(t-88) + .2109671630859*x(t-87) + .2217882667824*x(t-86) + .232750221535*x(t-85) + .24384375*x(t-84) + .2550596833406*x(t-83) +
     .2663889612269*x(t-82) + .2778226318359*x(t-81) + .2893518518519*x(t-80) + .3009678864656*x(t-79) + .312662109375*x(t-78) + .324426002785*x(t-77) +
     .3362511574074*x(t-76) + .3481292724609*x(t-75) + .3600521556713*x(t-74) + .3720117232711*x(t-73) + .384*x(t-72) + .3960091191045*x(t-71) +
     .408031322338*x(t-70) + .4200589599609*x(t-69) + .4320844907407*x(t-68) + .4441004819517*x(t-67) + .456099609375*x(t-66) + .4680746572989*x(t-65) +
     .4800185185185*x(t-64) + .4919241943359*x(t-63) + .5037847945602*x(t-62) + .5155935375072*x(t-61) + .52734375*x(t-60) + .5390288673683*x(t-59) +
     .5506424334491*x(t-58) + .5621781005859*x(t-57) + .5736296296296*x(t-56) + .5849908899378*x(t-55) + .596255859375*x(t-54) + .6074186243128*x(t-53)
     + .6184733796296*x(t-52) + .6294144287109*x(t-51) + .6402361834491*x(t-50) + .6509331642433*x(t-49) + .6615*x(t-48) + .6719314281322*x(t-47) +
     .6822222945602*x(t-46) + .6923675537109*x(t-45) + .7023622685185*x(t-44) + .7122016104239*x(t-43) + .721880859375*x(t-42) + .7313954038267*x(t-41)
     + .7407407407407*x(t-40) + .7499124755859*x(t-39) + .758906322338*x(t-38) + .7677181034795*x(t-37) + .77634375*x(t-36) + .7847793013961*x(t-35) +
     .7930209056713*x(t-34) + .8010648193359*x(t-33) + .8089074074074*x(t-32) + .81654514341*x(t-31) + .823974609375*x(t-30) + .8311924958406*x(t-29) +
     .8381956018519*x(t-28) + .8449808349609*x(t-27) + .8515452112269*x(t-26) + .8578858552156*x(t-25) + .864*x(t-24) + .86988498716*x(t-23) +
     .8755382667824*x(t-22) + .8809573974609*x(t-21) + .8861400462963*x(t-20) + .8910839888961*x(t-19) + .895787109375*x(t-18) + .9002474003545*x(t-17)
     + .904462962963*x(t-16) + .9084320068359*x(t-15) + .9121528501157*x(t-14) + .9156239194517*x(t-13) + .91884375*x(t-12) + .9218109854239*x(t-11) +
     .9245243778935*x(t-10) + .9269827880859*x(t-9) + .9291851851852*x(t-8) + .9311306468822*x(t-7) + .932818359375*x(t-6) + .9342476173683*x(t-5) +
     .9354178240741*x(t-4) + .9363284912109*x(t-3) + .9369792390046*x(t-2) + .9373697961878*x(t-1) + .9375*x(t) + .9373697961878*x(t+1) +
     .9369792390046*x(t+2) + .9363284912109*x(t+3) + .9354178240741*x(t+4) + .9342476173683*x(t+5) + .932818359375*x(t+6) + .9311306468822*x(t+7) +
     .9291851851852*x(t+8) + .9269827880859*x(t+9) + .9245243778935*x(t+10) + .9218109854239*x(t+11) + .91884375*x(t+12) + .9156239194517*x(t+13) +
     .9121528501157*x(t+14) + .9084320068359*x(t+15) + .904462962963*x(t+16) + .9002474003545*x(t+17) + .895787109375*x(t+18) + .8910839888961*x(t+19) +
     .8861400462963*x(t+20) + .8809573974609*x(t+21) + .8755382667824*x(t+22) + .86988498716*x(t+23) + .864*x(t+24) + .8578858552156*x(t+25) +
     .8515452112269*x(t+26) + .8449808349609*x(t+27) + .8381956018519*x(t+28) + .8311924958406*x(t+29) + .823974609375*x(t+30) + .81654514341*x(t+31) +
     .8089074074074*x(t+32) + .8010648193359*x(t+33) + .7930209056713*x(t+34) + .7847793013961*x(t+35) + .77634375*x(t+36) + .7677181034795*x(t+37) +
     .758906322338*x(t+38) + .7499124755859*x(t+39) + .7407407407407*x(t+40) + .7313954038267*x(t+41) + .721880859375*x(t+42) + .7122016104239*x(t+43) +
     .7023622685185*x(t+44) + .6923675537109*x(t+45) + .6822222945602*x(t+46) + .6719314281322*x(t+47) + .6615*x(t+48) + .6509331642433*x(t+49) +
     .6402361834491*x(t+50) + .6294144287109*x(t+51) + .6184733796296*x(t+52) + .6074186243128*x(t+53) + .596255859375*x(t+54) + .5849908899378*x(t+55)
     + .5736296296296*x(t+56) + .5621781005859*x(t+57) + .5506424334491*x(t+58) + .5390288673683*x(t+59) + .52734375*x(t+60) + .5155935375072*x(t+61) +
     .5037847945602*x(t+62) + .4919241943359*x(t+63) + .4800185185185*x(t+64) + .4680746572989*x(t+65) + .456099609375*x(t+66) + .4441004819517*x(t+67)
     + .4320844907407*x(t+68) + .4200589599609*x(t+69) + .408031322338*x(t+70) + .3960091191045*x(t+71) + .384*x(t+72) + .3720117232711*x(t+73) +
     .3600521556713*x(t+74) + .3481292724609*x(t+75) + .3362511574074*x(t+76) + .324426002785*x(t+77) + .312662109375*x(t+78) + .3009678864656*x(t+79) +
     .2893518518519*x(t+80) + .2778226318359*x(t+81) + .2663889612269*x(t+82) + .2550596833406*x(t+83) + .24384375*x(t+84) + .232750221535*x(t+85) +
     .2217882667824*x(t+86) + .2109671630859*x(t+87) + .2002962962963*x(t+88) + .1897851607711*x(t+89) + .179443359375*x(t+90) + .1692806034795*x(t+91)
     + .159306712963*x(t+92) + .1495316162109*x(t+93) + .1399653501157*x(t+94) + .1306180600767*x(t+95) + .1215*x(t+96) + .1126215322989*x(t+97) +
     .1039931278935*x(t+98) + .0956253662109*x(t+99) + .0875289351852*x(t+100) + .0797146312572*x(t+101) + .072193359375*x(t+102) +
     .0649761329933*x(t+103) + .0580740740741*x(t+104) + .0514984130859*x(t+105) + .0452604890046*x(t+106) + .0393717493128*x(t+107) +
     .03384375*x(t+108) + .0286881555628*x(t+109) + .0239167390046*x(t+110) + .0195413818359*x(t+111) + .0155740740741*x(t+112) +
     .0120269142433*x(t+113) + .008912109375*x(t+114) + .0062419750072*x(t+115) + .0040289351852*x(t+116) + .0022855224609*x(t+117) +
     .0010243778935*x(t+118) + .0002582510489*x(t+119) + ...; x(t)= __000000 note: label truncated to 80 characters

. 
. gen ugap = UNRATE - unrate_trend

. 
. collapse (mean) ugap, by(year)

. 
. tsset year
        time variable:  year, 1948 to 2018
                delta:  1 unit

. gen ugap_lag1 = L.ugap
(1 missing value generated)

. gen ugap_lag2 = L2.ugap
(2 missing values generated)

. 
. save "data/ugap.dta", replace
file data/ugap.dta saved

. 
end of do-file

. use "data/lfpr_age_sex_cohort.dta", clear

. do "/var/folders/0b/rk0m4vps1wdcl9c2sqsp12480000gn/T//SD02688.000000"

. merge m:1 year using "data/ugap.dta", keep(1 3) assert(2 3) nogen
(note: variable year was int, now float to accommodate using data's values)

    Result                           # of obs.
    -----------------------------------------
    not matched                             0
    matched                             7,269  
    -----------------------------------------

. 
. drop if lfp == .
(1,077 observations deleted)

. keep if inrange(age, 16, 90)
(296 observations deleted)

. egen lfp_tot = total(lfp * (year < 2000)), by(age sex)

. egen lfp_count = total((year < 2000)), by(age sex)

. gen lfp_age_avg = lfp_tot / lfp_count

. drop lfp_tot lfp_count

. 
. export delimited "data/lfpr_age_sex_cohort.csv", delim(",") replace nolabel
file data/lfpr_age_sex_cohort.csv saved

. 
end of do-file

